package ru.t022.c2h5oh;

public class Fertman
{
	
	// 
	static int[][] fertman_tab = { { 167, 335, 505, 674, 845, 1017, 1189, 1360, 1535, 1709, 1884, 2061, 2239 },
			{0, 144, 290, 436, 583, 730, 878, 1027, 1177, 1327, 1478, 1630, 1785 },
			{0,0,127,255,384,514,644,774,906,1039,1172,1306,1443},
			{0,0,0,144,229,344,460,577,694,812,932,1052,1174},
			{0,0,0,0,103,207,311,417,523,630,738,847,957},
			{0,0,0,0,0,95,190,285,382,480,578,677,779},
			{0,0,0,0,0,0,88,175,264,353,443,535,629},
			{0,0,0,0,0,0,0,81,163,246,329,414,501},
			{0,0,0,0,0,0,0,0,76,153,231,310,391},
			{0,0,0,0,0,0,0,0,0,72,144,218,295},
			{0,0,0,0,0,0,0,0,0,0,68,138,209},
			{0,0,0,0,0,0,0,0,0,0,0,65,133},
			{0,0,0,0,0,0,0,0,0,0,0,0,64}
	};
	static int[] fertman_compress = {0,60,123,189,257,328,405,485,568,654,744,833,925,1018,1114,1210,1308,1409,1511,1615,
									1719,1821,1934,2022,2120,2217,2318,2406,2499,2587,2674,2759,2841,2917,2991,3059,3124,3185,3242,3295,
									3347,3395,3439,3476,3511,3542,3570,3496,3617,3635,3650,3662,3670,3676,3679,3679,3679,3670,3662,3650,
									3637,3620,3601,3579,3555,3529,3500,3469,3436,3399,3360,3320,3278,3233,3183,3132,3079,3022,2961,2897,
									2830,2760,2687,2608,2525,2437,2345,2247,2143,2032,1912,1786,1651,1506,1348,1172,985,780,552,293,0};
	
	
	static int V0, N0,  N1;
	static int V1;
	static int X; // вода
	
	public static int ver_param()
	{
		if((N0<35) || (N0>95)) return -1;
		if((N1<30) || (N1>90)) return -1;
		if(N0<N1) return -1;
		return 0;
	}
	
	public static int V0(int v1, int n0, int n1)
	{
		N0=n0;
		N1=n1;
		V1 = v1;
		// спирта в начальном продукте в мл на литр раствора
		int C0 = n0*10;
		// воды в начальном V0 на литр раствора
		int h0 = fertman_compress[n0]/100 + (1000-n0*10); ////

		// спирта в конечном продукте в мл на литр раствора
		int C1 =n1*10*v1/1000;
		// воды в конечном V1 на литр раствора
		int h1 = fertman_compress[n1]/100+ (1000-n1*10); 

		// объём начального раствора взять
		V0 = 1000*C1/C0;
		
						
	    // воды добавить
		X = (h1*V1 - h0*V0)/1000;
		
		return X;
		
	}	
	public static int V1(int v0, int n0, int n1)
	{
		V0=v0; N0=n0; N1=n1;
		
		int T; // значение из таблицы
		int T1,T2,T3;
		
		if(ver_param()==-1)
				return -1;
		
		int k0=(N0-35)/5;
		int k00=(N0-35)%5;
		
		int k1=(N1-30)/5;
		int k11=(N1-30)%5;
		
		T=fertman_tab[k1][k0];
		T1=T;
		T2=fertman_tab[k1+1][k0];
		T3=T1;
		
		if(k00!=0)
		{
			T1 = T1 + line(k00,5,fertman_tab[k1][k0+1]-T);
			T3 = T1;
		}	
		if(k11!=0)
		{
			T2 = T2 + line(k00,5,fertman_tab[k1+1][k0+1]-T2);
			T3 = T3 + line(k11,5,T2-T1);
		}

		int X=(T3*V0)/1000;
		
		
		V1 = (int) (V0 * N0 / N1); // объём полученного раствора 
		
		return X;
	}
	static public int line(int x, int kx, int ky)
	{
		return (ky*x)/kx;
		
	}
	
}
